Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РуководительКонтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНазваниеКонтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКонтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЮр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресФакт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТелефоннаяКнига</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>35</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Контрагенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ПроцедурыРеквизитовФормы

	&НаКлиенте
	Процедура НаименованиеПриИзменении(Элемент)
			
		Если ПустаяСтрока(Объект.ПолноеНазваниеКонтр) Тогда
			Если Врег(Лев(Объект.Наименование,4)) = "ООО " Тогда
				Объект.ПолноеНазваниеКонтр = "Общество с ограниченной ответственностью" +" " +Сред(Объект.Наименование,5);
				
			ИначеЕсли Врег(Лев(Объект.Наименование,4)) = "ОАО " Тогда
				Объект.ПолноеНазваниеКонтр = "Открытое акционерное общество " +Сред(Объект.Наименование,5);
				
			ИначеЕсли Врег(Лев(Объект.Наименование,4)) = "ЗАО " Тогда
				Объект.ПолноеНазваниеКонтр = "Закрытое акционерное общество " +Сред(Объект.Наименование,5);
				
			ИначеЕсли Врег(Лев(Объект.Наименование,4)) = "ПАО " Тогда
				Объект.ПолноеНазваниеКонтр = "Публичное акционерное общество " +Сред(Объект.Наименование,5);
				
			ИначеЕсли Врег(Лев(Объект.Наименование,4)) = "АО " Тогда
				Объект.ПолноеНазваниеКонтр = "Акционерное Общество " +Сред(Объект.Наименование,5);
				
			ИначеЕсли Врег(Лев(Объект.Наименование,4)) = "ЧАО " Тогда
				Объект.ПолноеНазваниеКонтр = "Частное акционерное общество " +Сред(Объект.Наименование,5);
	
			ИначеЕсли Врег(Лев(Объект.Наименование,4)) = "ИП " Тогда
				Объект.ПолноеНазваниеКонтр = "Индивидуальный предприниматель " +Сред(Объект.Наименование,5);	
			
			Иначе
				Объект.ПолноеНазваниеКонтр = Объект.Наименование;
			КонецЕсли;
		КонецЕсли;

	КонецПроцедуры

	&НаКлиенте
	Процедура АдресЮрПриИзменении(Элемент)
		Объект.АдресФакт = Объект.АдресЮр;
	КонецПроцедуры
	
#КонецОбласти

#Область НеобходимоПеренести

	&НаСервере
	Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

		
	КонецПроцедуры

#КонецОбласти
